app/views/to_dos/_form.html.haml

SELECT "assignees".* FROM "assignees"
---
= f.label :department
= f.select :department, Assignee.all.collect{|a| [a.department]}