app/controllers/assignees_controller.rb

SELECT "assignees".* FROM "assignees"
---
  def index
    @assignees = Assignee.all

SELECT  "assignees".* FROM "assignees"  WHERE "assignees"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @assignee = Assignee.find(params[:id])

SELECT  "assignees".* FROM "assignees"  WHERE "assignees"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @assignee = Assignee.find(params[:id])

INSERT INTO "assignees" ("avatar", "department", "name") VALUES (?, ?, ?)  [["avatar", "john-saddington.jpeg"], ["department", "Developer"], ["name", "John Saddington"]]
---
  def create
    @new_assignee = Assignee.new(assignee_params)
    if @new_assignee.save

SELECT  "assignees".* FROM "assignees"  WHERE "assignees"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "assignees" SET "avatar" = ?, "department" = ? WHERE "assignees"."id" = 5  [["avatar", "Snodgrass.jpg"], ["department", "Programming"]]
---
  def update
    @assignee = Assignee.find(params[:id])
    if @assignee.update_attributes(assignee_params)

SELECT  "assignees".* FROM "assignees"  WHERE "assignees"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "assignees" WHERE "assignees"."id" = ?  [["id", 3]]
---
  def destroy
    @assignee = Assignee.find(params[:id])
    if @assignee.destroy