app/controllers/to_dos_controller.rb

  def index
    @to_dos = ToDo.all
---
SELECT "to_dos".* FROM "to_dos"

  def show
    @to_do = ToDo.find(params[:id])
---
SELECT  "to_dos".* FROM "to_dos"  WHERE "to_dos"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @to_do = ToDo.find(params[:id])
---
SELECT  "to_dos".* FROM "to_dos"  WHERE "to_dos"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @new_to_do = ToDo.new(to_do_params)
    if @new_to_do.save
---
INSERT INTO "to_dos" ("assignee_id", "completed", "deadline", "department", "file", "task") VALUES (?, ?, ?, ?, ?, ?)  [["assignee_id", 0], ["completed", "f"], ["deadline", "2014-08-31"], ["department", "Sales"], ["file", "How_to_Write_a_Business_Plan.pdf"], ["task", "Write a Business Plan"]]

  def update
    @to_do = ToDo.find(params[:id])
    if @to_do.update_attributes(to_do_params)
---
SELECT  "to_dos".* FROM "to_dos"  WHERE "to_dos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "to_dos" SET "assignee_id" = ?, "completed" = ?, "department" = ? WHERE "to_dos"."id" = 1  [["assignee_id", 1], ["completed", "t"], ["department", "1"]]

  def destroy
    @to_do = ToDo.find(params[:id])
    if @to_do.destroy
---
SELECT  "to_dos".* FROM "to_dos"  WHERE "to_dos"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "to_dos" WHERE "to_dos"."id" = ?  [["id", 1]]

  def download_file
    @to_do = ToDo.find(params[:id])
---
SELECT  "to_dos".* FROM "to_dos"  WHERE "to_dos"."id" = ? LIMIT 1  [["id", 7]]